<!-- dflook/terraform-github-actions {"workspace":"pull-request-target-harden","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"72377026d0dd93f56a3621be59a15ddbfd0f34e99780bb078d6f8ff25bbcec20","plan_job_ref":"Job Test actions using target, replace, and exclude #29 at https://github.com/dflook/terraform-github-actions/actions/runs/21525285306","plan_hash":"a4b037590553f6da14468d4526dd7788b389ef93f1748118dce0e8693eb8248e","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__ in the __pull-request-target-harden__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 5 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.also_exclude will be created
+   resource "random_string" "also_exclude" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.exclude_me will be created
+   resource "random_string" "exclude_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.keep_me will be created
+   resource "random_string" "keep_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
+   also_exclude = (known after apply)
!~  count        = "tTyHzxLw8M" -> (known after apply)
+   exclude_me   = (known after apply)
!~  foreach      = "5lKyhETPdI" -> (known after apply)
+   keep_me      = (known after apply)
```
</details>

:white_check_mark: Plan applied in [Test actions using target, replace, and exclude #29](https://github.com/dflook/terraform-github-actions/actions/runs/21525285306)
<details open><summary>Outputs</summary>

```hcl
also_exclude = "iGPE2GYBRo"
count        = "oinkXD53QH"
exclude_me   = "UPFoAp1MGk"
foreach      = "b7AMefg3GM"
keep_me      = "E5asAY0wyr"
```
</details>